#ATM Simulation
import ATMmodule as atm
import csv
import random as r

FILE_NAME = r"C:\Users\abhij\OneDrive - MSFT\Documents\Mine\Abhijeeth's\2025 VIT college work\SEM1\Problem Solving Using Python\Python project credited\atm_users.csv"

#Ensure CSV file has headers
try:
    with open(FILE_NAME, "r") as file:
        pass
except FileNotFoundError:
    with open(FILE_NAME, "w", newline="") as file:
        writer = csv.writer(file)
        writer.writerow(["Username", "PIN", "Balance", "ElectricityBill", "WaterBill", "GasBill", "Loan"])

#Program Start
while True:
    print("""
░█████╗░████████╗███╗░░░███╗  ░██████╗██╗███╗░░░███╗██╗░░░██╗██╗░░░░░░█████╗░████████╗██╗░█████╗░███╗░░██╗
██╔══██╗╚══██╔══╝████╗░████║  ██╔════╝██║████╗░████║██║░░░██║██║░░░░░██╔══██╗╚══██╔══╝██║██╔══██╗████╗░██║
███████║░░░██║░░░██╔████╔██║  ╚█████╗░██║██╔████╔██║██║░░░██║██║░░░░░███████║░░░██║░░░██║██║░░██║██╔██╗██║
██╔══██║░░░██║░░░██║╚██╔╝██║  ░╚═══██╗██║██║╚██╔╝██║██║░░░██║██║░░░░░██╔══██║░░░██║░░░██║██║░░██║██║╚████║
██║░░██║░░░██║░░░██║░╚═╝░██║  ██████╔╝██║██║░╚═╝░██║╚██████╔╝███████╗██║░░██║░░░██║░░░██║╚█████╔╝██║░╚███║
╚═╝░░╚═╝░░░╚═╝░░░╚═╝░░░░░╚═╝  ╚═════╝░╚═╝╚═╝░░░░░╚═╝░╚═════╝░╚══════╝╚═╝░░╚═╝░░░╚═╝░░░╚═╝░╚════╝░╚═╝░░╚══╝""")
    print("1. Register")
    print("2. Login")
    print("3. Exit")


    choice = input("Enter choice: ")

    if choice == "1":
        atm.register()
    elif choice == "2":
        atm.login()
    elif choice == "3":
        print("🏧 Thank you for using the ATM System. Goodbye!")
        break

    else:
        print("❌ Invalid choice. Try again!")